In [1]:
import pandas as pd

In [2]:
file = "../Resources/shopping_data.csv"

In [3]:
df = pd.read_csv(file)

In [4]:
df.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [5]:
df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [6]:
df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [7]:
df.count()

CustomerID                203
Card Member               201
Age                       201
Annual Income             203
Spending Score (1-100)    202
dtype: int64

In [8]:
# find null values
for i in df.columns:
    print(f"column {i} has {df[i].isnull().sum()} values")

column CustomerID has 0 values
column Card Member has 2 values
column Age has 2 values
column Annual Income has 0 values
column Spending Score (1-100) has 1 values

In [9]:
# drop null values
df = df.dropna()

In [10]:
# find duplicate enteries
print(f" Duplicate Enteries: {df.duplicated().sum()}")

 Duplicate Enteries: 0

In [11]:
# remove or drop the column, in this example have already removed so am commenting it out
df = df.drop(columns=["CustomerID"])
df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [12]:
df.count()

Card Member               200
Age                       200
Annual Income             200
Spending Score (1-100)    200
dtype: int64

In [13]:
# tranform string column to numeric column
# type1
member ={"Yes" :1,
        "No":0}

In [14]:
df["Card Member"] = df["Card Member"].apply(lambda X:member[X])

In [15]:
df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [16]:
# type 2
#def change_string(member):
    #if member=="Yes":
        #return 1
    #else:
        #return 0
#df["Card Member"] = df["Card Member"].apply(change_string)
#df.head()

In [17]:
# The scale for Annual Income is much larger than all the other values in the dataset. 
# We can adjust this format by dividing by 1,000 to rescale those data points, as shown below:
df["Annual Income"] = df["Annual Income"]/1000
df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [18]:
# Reformat the names of the columns
df.rename(columns={"Card Member":"CardMember",
                    "Annual Income":"AnnualIncome",
                    "Spending Score(1-100)": "SpendingScore(1-100)"})
df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [19]:
# Saving cleaned data into csv form
file_path = "../Resources/shopping_data_cleaned.csv"
df.to_csv(file_path, index=False)

In [20]:
# Saving cleaned data into json form
file_path = "../Resources/shopping_data_cleaned.json"
df.to_json(file_path, index=True)